src/cfe/КСП/Documents/КСП_СуточныйОтчетСГашением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_СуточныйОтчетСГашением</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ПродажиНаличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ПродажиТерминал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ПродажиСертификат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ВозвратыНаличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ВозвратыТерминал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ВозвратыСертификат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ОшибочныеЧекиНаличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ОшибочныеЧекиТерминал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ_ОшибочныеЧекиСертификат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Терминал_Продажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Терминал_Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБП_Продажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБП_Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМаркируемыхНоменклатур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подели_Продажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подели_Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_СуточныйОтчетСГашением/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Касса") Тогда 
		Объект.Касса = Параметры.Касса;
	КонецЕсли;
	
	
	Пересчитать();
	
КонецПроцедуры                            
 
&НаСервере
Процедура Пересчитать()
	       
	ККМ_ПродажиВсего 		= Объект.ККМ_ПродажиНаличные		+ Объект.ККМ_ПродажиТерминал 		+ Объект.ККМ_ПродажиСертификат;
	ККМ_ВозвратыВсего 		= Объект.ККМ_ВозвратыНаличные 		+ Объект.ККМ_ВозвратыТерминал 		+ Объект.ККМ_ВозвратыСертификат;	
	ККМ_ОшибочныеЧекиВсего	= Объект.ККМ_ОшибочныеЧекиНаличные 	+ Объект.ККМ_ОшибочныеЧекиТерминал 	+ Объект.ККМ_ОшибочныеЧекиСертификат;
	
	ККМ_ЧекиВозвратНаличные		= Объект.ККМ_ВозвратыНаличные 	+ Объект.ККМ_ОшибочныеЧекиНаличные;
	ККМ_ЧекиВозвратТерминал		= Объект.ККМ_ВозвратыТерминал 	+ Объект.ККМ_ОшибочныеЧекиТерминал;		
	ККМ_ЧекиВозвратСертификат 	= Объект.ККМ_ВозвратыСертификат + Объект.ККМ_ОшибочныеЧекиСертификат;
	
	ККМ_ЧекиВозвратВсего = ККМ_ВозвратыВсего + ККМ_ОшибочныеЧекиВсего;
	                                                                 
	ВыручкаНаличные		= Объект.ККМ_ПродажиНаличные 	- Объект.ККМ_ВозвратыНаличные	- Объект.ККМ_ОшибочныеЧекиНаличные;
	ВыручкаТерминал		= Объект.ККМ_ПродажиТерминал 	- Объект.ККМ_ВозвратыТерминал	- Объект.ККМ_ОшибочныеЧекиТерминал;
	ВыручкаСертификат	= Объект.ККМ_ПродажиСертификат 	- Объект.ККМ_ВозвратыСертификат	- Объект.ККМ_ОшибочныеЧекиСертификат;	
	
	ВыручкаВсего 	= ККМ_ПродажиВсего - ККМ_ВозвратыВсего - ККМ_ОшибочныеЧекиВсего;  
	//ТерминалВсего	= Объект.Терминал_Продажи - Объект.Терминал_Возврат;                                           
	ТерминалВсего	= Объект.Терминал_Продажи - Объект.Терминал_Возврат + Объект.СБП_Продажи - Объект.СБП_Возврат; 
	НеобнуленнаяСуммаНаКонецСмены	= НеобнуленнаяСуммаНаНачалоСмены + ККМ_ПродажиВсего;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьДокумент(Элемент)
	Пересчитать();
КонецПроцедуры

// Чернов. Получаем данные из Розницы 

//&НаСервереБезКонтекста
//Функция ЗаполнитьСБППоЧекамНаСервере(СтруктураПолученияСБП)  
//	
//	КассаККМ = СтруктураПолученияСБП.Касса;
//	СуммыСБП = Новый Структура;
//	СуммыСБП.Вставить("СуммаОплатСБП", 0);
//	СуммыСБП.Вставить("СуммаВозвратовСБП", 0);
//	
//	Если СтруктураПолученияСБП.ВидОплаты = "СБП" Тогда
//		ВидОплаты = Перечисления.ВидыБезналичныхОплат.СБП;
//	ИначеЕсли СтруктураПолученияСБП.ВидОплаты = "Подели" Тогда 
//		ВидОплаты = Перечисления.ВидыБезналичныхОплат.Подели;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "    ВЫБРАТЬ
//	|		СУММА(ЧекККМОплата.Сумма) КАК СуммаОплатСБП
//	|	ИЗ
//	|		Документ.ЧекККМ.БезналичнаяОплата КАК ЧекККМОплата
//	|	ГДЕ
//	|		ЧекККМОплата.Ссылка.КассаККМ = &КассаККМ
//	|		И ЧекККМОплата.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|		И ЧекККМОплата.Ссылка.Проведен
//	|		И ЧекККМОплата.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)		
//	|		И ЧекККМОплата.ВидОплаты = &ВидОплаты
//	|;		
//	|		  ВЫБРАТЬ
//	|		СУММА(ЧекККМОплата.Сумма) КАК СуммаВозвратовСБП
//	|	ИЗ
//	|		Документ.ЧекККМВозврат.БезналичнаяОплата КАК ЧекККМОплата
//	|	ГДЕ
//	|		ЧекККМОплата.Ссылка.КассаККМ = &КассаККМ
//	|		И ЧекККМОплата.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|		И ЧекККМОплата.Ссылка.Проведен		
//	|		И ЧекККМОплата.ВидОплаты = &ВидОплаты";
//	
//	Запрос.УстановитьПараметр("ВидОплаты", ВидОплаты);
//	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(СтруктураПолученияСБП.Дата));
//	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(СтруктураПолученияСБП.Дата));
//	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
//	Пакет = Запрос.ВыполнитьПакет();
//	ВыборкаОплаты = Пакет[0].Выбрать();
//	Если ВыборкаОплаты.Следующий() Тогда
//		СуммыСБП.СуммаОплатСБП = ВыборкаОплаты.СуммаОплатСБП;
//	КонецЕсли;
//	
//	ВыборкаВозвраты = Пакет[1].Выбрать();
//	Если ВыборкаВозвраты.Следующий() Тогда
//		СуммыСБП.СуммаВозвратовСБП = ВыборкаВозвраты.СуммаВозвратовСБП;
//	КонецЕсли;
//	
//	Возврат СуммыСБП;
//КонецФункции

//&НаКлиенте
//Процедура ЗаполнитьСБППоЧекам(Команда)
//	СтруктураПолученияСБП = Новый Структура;
//	СтруктураПолученияСБП.Вставить("Касса", Объект.Касса);
//	СтруктураПолученияСБП.Вставить("Дата", Объект.Дата);
//	СтруктураПолученияСБП.Вставить("ВидОплаты", "СБП");
//	СуммыСБП = ЗаполнитьСБППоЧекамНаСервере(СтруктураПолученияСБП);
//	
//	Объект.СБП_Продажи = СуммыСБП.СуммаОплатСБП;
//	Объект.СБП_Возврат = СуммыСБП.СуммаВозвратовСБП;
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура ЗаполнитьПоделиПоЧекам(Команда)
//	СтруктураПолученияСБП = Новый Структура;
//	СтруктураПолученияСБП.Вставить("Касса", Объект.Касса);
//	СтруктураПолученияСБП.Вставить("Дата", Объект.Дата);
//	СтруктураПолученияСБП.Вставить("ВидОплаты", "Подели");
//	СуммыСБП = ЗаполнитьСБППоЧекамНаСервере(СтруктураПолученияСБП);
//	
//	Объект.Подели_Продажи = СуммыСБП.СуммаОплатСБП;
//	Объект.Подели_Возврат = СуммыСБП.СуммаВозвратовСБП;
//КонецПроцедуры
